import { WordCategories } from './types';

export const APP_TITLE = "SPY 🕵️"; // Farsi: Shadow Protocol
export const MIN_PLAYERS = 3;
export const MAX_PLAYERS = 12;
export const DEFAULT_TIMER_MINUTES = 5;

export const WORD_CATEGORIES: WordCategories = {
  "مکان‌ها": ["آبشار", "آپارتمان", "آتلیه عکاسی", "آرایشگاه", "آزمایشگاه", "آژانس تبلیغاتی", "آژانس مسافرتی", "آسیا", "آشپزخانه", "آفریقا", "آمریکای جنوبی", "آمریکای شمالی", "اتوبان", "اروپا", "استادیوم", "استخر", "اسکله", "اداره پست", "انبار", "ایستگاه اتوبوس", "ایستگاه پلیس", "ایستگاه قطار", "ایستگاه فضایی", "ایستگاه مترو", "بازار", "باغ", "باغ وحش", "باشگاه", "باشگاه ورزشی", "بانک", "برج", "برزخ", "بندر", "بنگاه املاک", "بهشت", "بیابان", "بیمارستان", "پادگان", "پارک", "پارک آبی", "پارکینگ", "پاساژ", "پالایشگاه", "پایگاه بسیج", "پزشکی قانونی", "پل", "پیست اتومبیلرانی", "تالار", "تئاتر", "ترمینال", "تعمیرگاه", "تیمارستان", "تونل", "جکوزی", "جزیره", "جنگل", "جهنم", "چاه", "چاپخانه", "چایخانه", "حرم", "حمام", "خانه", "خانه سالمندان", "حوزه علمیه", "خوابگاه", "خیابان", "دادگاه", "داروخانه", "دانشگاه", "دره", "دریا", "دریاچه", "دفتر کار", "دفتر وکالت", "رصدخانه", "رستوران", "رودخانه", "روستا", "زمین گلف", "زندان", "زیرزمین", "ساحل", "سازمان ملل", "سایت کارگاهی", "سد", "سفارت", "سونا", "سوپرمارکت", "سیرک", "سینما", "شالیزار", "شهر", "شهربازی", "شهرداری", "صحرا", "طویله", "عطاری", "عوارضی", "فروشگاه", "فرودگاه", "قاره", "قبرستان", "قصر", "قطب", "قطار", "کافه", "کافی نت", "کافی شاپ", "کارخانه", "کتابخانه", "کشتارگاه", "کشور", "کلانتری", "کلیسا", "کوچه", "کوه", "کویر", "گیم نت", "گلخانه", "محضر", "مدرسه", "مرده شورخانه", "مزرعه", "مسجد", "معدن", "معبد", "موزه", "میدان", "مهدکودک", "نانوایی", "نخلستان", "نجاری", "نمایشگاه خودرو", "نیروگاه", "هتل", "ویلا"],
  "حیوانات":  ["آهو", "اژدها", "اردک", "اسب", "اسب آبی", "بز", "ببر", "بلبل", "بوفالو", "بوقلمون", "پاندا", "پرستو", "پروانه", "پشه", "پلنگ", "پنگوئن", "تمساح", "جوجه تیغی", "جغد", "حلزون", "خر", "خرچنگ", "خرگوش", "خروس", "خرس", "خفاش", "خوک", "دارکوب", "دلفین", "راسو", "روباه", "زرافه", "زنبور", "ستاره دریایی", "سگ", "سمور", "سنجاب", "سوسمار", "شاهین", "شپش", "شتر", "شیر", "طوطی", "عقاب", "عقرب", "عنکبوت", "غاز", "فلامینگو", "فیل", "قناری", "قو", "قورباغه", "کبوتر", "کرگدن", "کرم", "کشفدوزک", "کفتار", "کلاغ", "کانگورو", "کوالا", "کوسه", "گاو", "گربه", "گرگ", "گنجشک", "گوزن", "گورخر", "گوسفند", "لاک پشت", "لک لک", "ماموت", "مار", "ماهی", "ماهی قرمز", "ماهی مرکب", "مگس", "ملخ", "مورچه", "موش", "موش کور", "میگو", "میمون", "نهنگ", "وزغ", "هشت پا", "هزارپا", "همستر", "یوزپلنگ"],
  "مشاغل": ["آتش‌نشان", "آرایشگر", "آهنگساز", "آخوند", "آشپز", "استاد دانشگاه", "ادمین اینستا", "بازیگر", "باغبان", "باریستا (قهوه چی)", "برقکار", "برنامه نویس", "بلاگر اینستا", "بیمه", "پرستار", "پستچی", "پزشک", "پلیس", "تبلیغات چی", "جراح", "جامعه‌شناس", "حسابدار", "خانه دار", "خبرنگار", "خلبان", "خواننده", "خیاط", "دامپزشک", "داروساز", "دانشمند", "دادستان", "دزد", "دلاک", "دلقک", "دندانپزشک", "دوبلور", "رئیس جمهور", "راننده", "راننده تاکسی", "رفتگر", "روان پزشک", "روانشناس", "ساعت ساز", "ساقی", "سرباز", "سمسار", "سیاستمدار", "شاعر", "شکارچی", "شهردار", "طراح", "طلا فروش", "عطار", "عکاس", "فرمانده", "فرش باف", "فروشنده", "فضانورد", "فوتبالیست", "فیزیکدان", "فیلمبردار", "فیلمساز", "قاضی", "قصاب", "قناد", "کارآگاه", "کارگر", "کارگردان", "کارمند", "کارمند بانک", "کشاورز", "کتابدار", "کفاش", "کلانتر", "کلیدساز", "گارسون", "گرافیست", "گزارشگر", "گل فروش", "غواص", "لوله کش", "مجری", "محافظ شخصی", "مداح", "مدل", "مدیر", "مترجم", "مکانیک", "مهماندار", "مورخ", "منجم", "معمار", "معلم", "نانوا", "نجار", "نقاش", "نوازنده", "نویسنده", "وکیل", "هکر", "هنرمند", "ورزشکار"],
  "وسایل شخصی": [ "موبایل", "کلید", "کیف پول", "عینک", "ساعت", "کتاب", "دفترچه", "خودکار", "شانه", "مسواک",
    "لپ‌تاپ", "هدفون", "چتر", "کفش", "کلاه", "لباس", "شلوار", "پیراهن", "جوراب", "دستکش",
    "شال", "کمربند", "انگشتر", "گردنبند", "دستبند", "گوشواره", "عطر", "کرم", "رژ لب", "کیف دستی",
    "کوله‌پشتی", "چمدان", "دوربین", "شارژر", "پاوربانک", "فلش مموری", "عینک آفتابی", "لنز چشم", "ناخن‌گیر", "موچین",
    "سشوار", "ریش‌تراش", "حوله", "صابون", "شامپو", "شناسنامه", "کارت بانکی", "گواهینامه رانندگی", "بلیط", "پاسپورت",
    "هندزفری", "تبلت", "مجله", "مداد", "ماسک"],
  "خوردنی‌ها": [  "سیب", "موز", "پرتغال", "نان", "برنج", "کباب", "قرمه‌سبزی", "چای", "قهوه", "آب",
    "بستنی", "شکلات", "پیتزا", "ماکارونی", "هندوانه", "خیار", "توت‌فرنگی", "گیلاس", "آلبالو", "هلو",
    "زردآلو", "انگور", "انار", "لیمو", "سالاد", "سوپ", "آش", "دیزی", "کله‌پاچه", "جوجه کباب",
    "ماهی پلو", "زرشک پلو", "پنیر", "کره", "ماست", "تخم‌مرغ", "عسل", "مربا", "نوشابه", "دوغ",
    "آبمیوه", "شیر", "کیک", "شیرینی", "بیسکویت", "چیپس", "پفک", "آجیل", "پسته", "بادام",
    "گردو", "ساندویچ", "کالباس", "سوسیس", "گوجه فرنگی"],
  "مفاهیم": [ "عشق", "صلح", "زمان", "شادی", "غم", "رویا", "آزادی", "عدالت", "خطر", "سکوت",
    "دانش", "قدرت", "زیبایی", "ترس", "امید", "زندگی", "مرگ", "موفقیت", "شکست", "حقیقت",
    "دروغ", "خاطره", "فراموشی", "خیال", "واقعیت", "هنر", "علم", "فلسفه", "تاریخ", "آینده",
    "گذشته", "حال", "سرنوشت", "شانس", "ریسک", "امنیت", "اعتماد", "خیانت", "نفرت", "خشم",
    "مهربانی", "شجاعت", "غرور", "تواضع", "صبر", "عجله", "جهل", "قانون", "هرج و مرج", "نظم",
    "کار", "استراحت", "خواب", "بیداری", "جوانی"],
  "وسایل": [
    "مبل", "لامپ", "کیبورد", "چکش", "بیل", "جامدادی", "قاب عکس", "پنجره", "تلویزیون", "میز",
    "صندلی", "تخت", "کمد", "قفسه", "فرش", "پرده", "در", "آینه", "کامپیوتر", "مانیتور",
    "ماوس", "پرینتر", "تلفن", "یخچال", "اجاق گاز", "مایکروویو", "ماشین لباسشویی", "قابلمه", "بشقاب", "لیوان",
    "قاشق", "چنگال", "چاقو", "اره", "پیچ‌گوشتی", "انبردست", "آچار", "دریل", "نردبان", "سطل",
    "جارو", "دوچرخه", "ماشین", "موتورسیکلت", "پله", "آسانسور", "تخته وایت‌برد", "منگنه", "قیچی", "چسب",
    "گلدان", "ساعت دیواری", "رادیو", "دوربین مداربسته", "کپسول آتش نشانی", "لپ‌تاپ", "اسپیکر", "هدفون", "وب‌کم", "پروژکتور",
    "مودم", "هارد اکسترنال", "فلش مموری", "تبلت", "گوشی موبایل", "شارژر", "کتابخانه", "جاکفشی", "رخت‌آویز", "پاتختی",
    "میز تحریر", "بخاری", "کولر", "پنکه", "کتری", "فنجان", "نعلبکی", "ماهیتابه", "مخلوط‌کن", "آبمیوه‌گیری",
    "توستر", "قهوه‌ساز", "سینک ظرفشویی", "کابینت", "خودکار", "مداد", "دفتر", "پاک‌کن", "خط‌کش", "ماشین حساب",
    "زونکن", "کیف", "کوله‌پشتی", "عینک", "ساعت مچی", "کلید", "چتر", "مسواک", "حوله", "اتو", 
    "میز اتو", "متر", "آچار فرانسه", "سیم‌چین", "دم باریک", "چراغ قوه", "باتری", "نیمکت", "شلنگ", "فرغون"
  ],
  "طبیعت و پدیده‌ها": [
    "خورشید", "ماه", "ستاره", "آسمان", "زمین", "ابر", "باران", "برف", "باد", "طوفان",
    "رعد و برق", "رنگین‌کمان", "مه", "تگرگ", "درخت", "گل", "گیاه", "سبزه", "برگ", "خاک",
    "سنگ", "صخره", "تپه", "دره", "غار", "آتشفشان", "موج", "چشمه", "یخ", "آتش",
    "سایه", "کهکشان", "سیاره", "اقیانوس", "بیابان", "شفق قطبی", "کسوف", "خسوف", "گردباد", "سیل"
  ]
};
export const EVERYTHING_CATEGORY_KEY = "همه‌چیز 🌍"; // Key for the "Everything" category, added emoji
export const CUSTOM_CATEGORY_KEY = "کلمه سفارشی 📝"; // Key for custom word category

export const TIMER_INCREMENT_OPTIONS = [1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 15]; // in minutes
export const PLAYER_NAME_PREFIX = "بازیکن"; // Farsi: Player